<?php
return [
    //API画面内で使用
    'list' => [
        'title' => 'API一覧画面',
        'name' => 'API名',
        'form' => 'フォーム',
        'btm' => 'APIボタン',
        'id' => 'ID',
        'user_name' => '名前',
        'age' => '年齢',
        'get' => '一覧',
        'post' => '登録',
        'put' => '編集',
        'delete' => '削除',
        'get_btm' => 'GETボタン',
        'post_btm' => 'POSTボタン',
        'put_btm' => 'PUTボタン',
        'delete_btm' => 'DELETEボタン'
    ],
    //とりあえず設置。各APIで使うことがあればここに。
    'get' => [],
    'post' => [],
    'put' => [],
    'delete' =>[],

    //APIエラータイトル文言
    'api_e_title' => [
        't0001' => '項目エラー',
        't0002' => '項目記入漏れ',
        't0003' => 'ID未登録',
        't0004' => '入力ミス',
        't0005' => ''
    ],
    //APIエラー文言
    'api_mes' => [
        'm0001' => 'idが数値以外を定義している。',
        'm0002' => '未記入の項目がある',
        'm0003' => 'IDがありません',
        'm0004' => '',
        'm0005' => ''
    ]
];
